{
  "header": "Hector Rodriguez Portfolio",
  "change_language": "Change language",
  "download": "Download CV",
  "degree": "Computer Systems Engineer | Front-end Developer",
  "about_me": "Hello, my name is Héctor. I am a computer systems engineer focused on front-end web development. My goal is to contribute and apply my knowledge in transforming ideas into functional digital experiences, as well as to continue growing alongside the team or company I work with, improving these skills and continuing to learn new approaches along the way.",
  "about_me_location": "Available for remote work",
  "cv": "/Portfolio_Hector_Rodriguez/CV_Eng.pdf",
  "contact": "Contact",
  "skills": "Skills",
  "technologies": "Technologies and tools",
  "photos": "Extra Photos",
  "projects": "Principal Projects",
  "project1": "Portfolio",
  "project1_description": "My personal portfolio",
  "project2": "Creamery Announcement",
  "project2_description": "Advertising announcement for 'Cremería Agropecuaria'",
  "project3": "Twitch Bot",
  "project3_description": "Twitch bot to moderate my own channel using the Twitch tmi API",
  "project3_content": "I developed a web application in React with TypeScript and CSS, integrated with Twitch's TMI API, to create a custom moderation bot that automates tasks on my Twitch channel. Later, I converted the application into a Windows desktop app using Electron, achieving a stable solution.",
  "project4": "Virtual Reality Environment",
  "project4_description": "Virtual Reality environment inspired by a real classroom at my university",
  "project4_content": "Development of a Virtual Reality environment using OpenSpace3D, where I created a 3D model of a real university space, as well as interactive scenes aimed at exploring the environment. The project included the integration of interaction devices such as an Xbox controller and Myo armband, allowing control of movement and navigation within the virtual reality application.",
  "project5": "Note Tree, note management app",
  "project5_description": "Web application for note management, allowing you to create, edit, and organize notes with sections, attach other notes and documents, and manage users through authentication",
  "project5_content": "Web application for note management, focused on the organization and connection of information. It allows creating, editing, and structuring notes through sections, attaching related notes, and associating documents with each note, as well as featuring a user authentication system (registration and login) integrated with an API. \n\nI developed the frontend entirely myself, including the interface design, user experience, and implementation of key functionalities such as document upload via drag and drop, state management, and validations. \n\nOn the backend, I worked with NestJS and Docker, making small corrections to the existing system and developing all the necessary logic for uploading, managing, and associating documents with the notes.",
  "work_title": "Work Experience",
  "work1_name": "Web Development Teacher",
  "work1_place": "Salinas High School, Salinas de Hgo.",
  "work1_date": "February 2022 - June 2022",
  "work1_description1": "Teaching theoretical and practical classes on web development at the high school level.",
  "work1_description2": "Teaching HTML, CSS, and JavaScript fundamentals through hands-on projects.",
  "work2_name": "Outsourcing Developer",
  "work2_place": "Home Office",
  "work2_date": "May 2023 - August 2025",
  "work2_description1": "Development and maintenance of web and mobile applications, implementing efficient architectures and CI/CD in GitHub Actions.",
  "work2_description2": "Optimizing Docker containers to improve application scalability and deployment.",
  "work2_description3": "API integration with NestJS and development of dynamic interfaces with React Native.",
  "contact_me": "Contact Me",
  "contact_description": "You can contact me through the form or send me an email directly.",
  "name_placeholder": "Name",
  "email_placeholder": "Email",
  "message_placeholder": "Message",
  "contact_cta": "Send",
  "contact_sending": "Sending...",
  "contact_success": "Message sent successfully",
  "contact_error": "There was an error. Please try again."
}
