{
  "header": "Hector Rodriguez Portafolio",
  "change_language": "Cambiar idioma",
  "download": "Descargar CV",
  "degree": "Ingeniero en Sistemas Computacionales | Desarrollador Front-end",
  "about_me": "Hola, mi nombre es Héctor. Soy ingeniero en sistemas computacionales enfocado en el desarrollo web front-end. Mi objetivo es contribuir y aplicar mis conocimientos en transformar ideas en experiencias digitales funcionales, así como seguir creciendo junto al equipo o la empresa con la que trabaje, mejorando estas habilidades y continuando aprendiendo nuevos enfoques en el camino.",
  "about_me_location": "Disponible para trabajo remoto",
  "cv": "/Portfolio_Hector_Rodriguez/CV.pdf",
  "contact": "Contacto",
  "skills": "Habilidades",
  "technologies": "Tecnologías y Herramientas",
  "photos": "Fotos Extra",
  "projects": "Proyectos Principales",
  "project1": "Portafolio",
  "project1_description": "Mi portafolio personal",
  "project2": "Anuncio Cremería",
  "project2_description": "Anuncio publicitario para 'Cremería Agropecuaria'",
  "project3": "Bot de Twitch",
  "project3_description": "Bot de Twitch para moderar mi propio canal usando la API tmi de Twitch",
  "project3_content": "Desarrollé una aplicación web en React con TypeScript y CSS, integrada con la API TMI de Twitch, para crear un bot de moderación personalizado que automatiza tareas en mi canal de Twitch. Posteriormente, convertí la aplicación en una aplicación de escritorio para Windows utilizando Electron, logrando una solución estable.",
  "project4": "Ambiente de Realidad Virtual",
  "project4_description": "Entorno de Realidad Virtual inspirado en un aula real de mi universidad",
  "project4_content": "Desarrollo de un entorno de Realidad Virtual utilizando OpenSpace3D, donde realicé el modelado 3D de un espacio universitario real, así como la creación de escenas interactivas orientadas a la exploración del entorno. El proyecto incluyó la integración de dispositivos de interacción como control Xbox y brazalete Myo, permitiendo el control del desplazamiento y la navegación dentro de la aplicación de realidad virtual.",
  "project5": "Note Tree, App de manejo de notas",
  "project5_description": "Aplicación web para la gestión de notas, que permite crear, editar y organizar notas con secciones, adjuntar otras notas y documentos, y gestionar usuarios mediante autenticación.",
  "project5_content": "Aplicación web para la gestión de notas, orientada a la organización y relación de información. Permite crear, editar y estructurar notas mediante secciones, adjuntar otras notas relacionadas y asociar documentos a cada nota, además de contar con un sistema de autenticación de usuarios (registro e inicio de sesión) integrado a una API. \n\n El frontend fue desarrollado completamente por mí, incluyendo el diseño de la interfaz, la experiencia de usuario y la implementación de funcionalidades clave como la subida de documentos mediante drag and drop, manejo de estados y validaciones. \n\n En el backend, trabajé con NestJS y Docker, realizando pequeñas correcciones al sistema existente y desarrollando toda la lógica necesaria para la carga, manejo y asociación de documentos a las notas.",
  "work_title": "Experiencia Laboral",
  "work1_name": "Docente de Desarrollo Web",
  "work1_place": "Escuela preparatoria de Salinas, Salinas de Hgo.",
  "work1_date": "Febrero 2022 - Junio 2022",
  "work1_description1": "Impartición de clases teóricas y prácticas sobre desarrollo web a nivel preparatoria.",
  "work1_description2": "Enseñanza de fundamentos de HTML, CSS y JavaScript mediante proyectos prácticos.",
  "work2_name": "Desarrollador Outsourcing",
  "work2_place": "Trabajo Remoto",
  "work2_date": "Mayo 2023 - Agosto 2025",
  "work2_description1": "Desarrollo y mantenimiento de aplicaciones web y móviles, implementando arquitecturas eficientes y CI/CD en GitHub Actions.",
  "work2_description2": "Optimización de contenedores Docker para mejorar la escalabilidad y despliegue de aplicaciones.",
  "work2_description3": "Integración de APIs con NestJS y desarrollo de interfaces dinámicas con React Native.",
  "contact_me": "Contáctame",
  "contact_description": "Puedes contactarme a través del formulario o enviarme un correo directamente.",
  "name_placeholder": "Nombre",
  "email_placeholder": "Correo Electrónico",
  "message_placeholder": "Mensaje",
  "contact_cta": "Enviar",
  "contact_sending": "Enviando...",
  "contact_success": "¡Mensaje enviado con éxito!",
  "contact_error": "Hubo un error. Inténtalo de nuevo."
}
